const newsForModal = [
    ["news1", "Сердце вашего автомобиля", "img/news1.png", `<p>Двигатель — один из главных предметов гордости настоящего автолюбителя. Сердце автомобиля, гордо поблескивающее хромированными трубками цилиндров, способно впечатлить даже тех, кто никогда не интересовался культурой вождения. И если раньше число цилиндров служило свидетельством мощности движка, то теперь конструкторы все чаще ищут обходные пути, сохраняя и даже увеличивая производительность за счет турбин и новых инженерных решений.</p>
<p> Впрочем, вы наверняка видели под капотом стального коня силовые агрегаты с восемью и даже с двенадцатью цилиндрами. Но мы точно удивим вас тем, что это далеко не предел. За свою долгую историю автомобильная промышленность породила настоящих монстров, каждому из которых нашлось свое применение.</p>
<p>Начинается парад с крайне редкого типа двигателей — 14-цилиндрового мотора. Отыскать автомобили, для которых был изготовлен такой движок, практически невозможно. По слухам, в свое время Honda должна была изготовить для Maclaren F1 специальный мотор с 14 цилиндрами. Однако куда более широкую известность получил морской рядный двигатель Wärtsilä-Sulzerin RTA96-C — один из самых мощных ДВС во всем мире.</p>
<p>Зато 16-цилиндровые двигатели встречаются гораздо чаще. Так, даже Cadillac установил на Phaeton движок V16. На этом поприще отметился и бренд Alfa Romeo, правда, под капотом роскошного итальянца скрывался не полноценный 16-цилиндровый двигатель, а установка из спаренных V8 — один в передней части, а другой в задней.</p>
<p>Могучий V18, как ни удивительно, тоже использовался для легковых автомобилей. Так, этот монстр стал сердцем Bugatti EB118, да и Ferrari не устояли перед искушением опробовать 18-цилиндровый двигатель в деле. Увы, в гонках «Формулы-1» использование моторов старше V12 запрещено регламентом.</p>
<p>20 цилиндров — это уже удел тяжелой техники. Так, знаменитый Caterpillar 797F, тягловая лошадка на крупных стройках и карьерных отвалах, живет за счет именно такого силового агрегата.</p>
<p>Однако настоящий рекордсмен — это собранный из деталей конструктора LEGO 100-цилиндровый движок, состоящий из пяти секций V20. Да, он пластиковый. Да, он работает! </p>`],
    ['news2', `Название статьи`, 'img/news2.png', `В обратных ковычках написана статья`]
];

$(`#news1`).animatedModal();
$(`#news2`).animatedModal();
$(`#news3`).animatedModal();
$(`#news4`).animatedModal();